app/controllers/songs_controller.rb

  def index
    if params[:artist_id]
      if !(artist = Artist.find(params[:artist_id]))
        redirect_to artists_path
      else
        @songs = artist.songs
      end
    else
      @songs = Song.all
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 1]]

  def show
    if params[:artist_id]
      if artist = Artist.find(params[:artist_id]) && !(@song = Song.find_by(id: params[:id]))
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]